const about_data = [
    {
        id: "about_modal1",
        title1: "廟宇介紹",
        title2: "—TEMPLE INTRODUCTION—",
        img: "./images/about1.png",
        img2: "./images/about1-1.png",
        text: [
            "石碇集順廟，又稱雙忠廟、尪公廟、仙公廟等，是石碇地區居民的信仰中心，為當地最悠久的寺廟之一，也是石碇的重要地標。廟宇建立於清道光十八年（1838年），主祀雙忠(保儀尊王及保儀大夫)。",
            "後於日治初期由中醫醫師「呂林烏木」見廟宇傾斜重建廟宇並建立二樓明德宮以，主祀呂純陽祖師（呂洞賓），由木柵指南宮分香而來。",
            "集順廟在茶葉興盛的日治時期是茶葉交易中心，廟埕曾是石碇、坪林、平溪、深坑、宜蘭等鄉鎮居民交流的場所，具有重要的歷史和文化意義。"
        ]
    },
    {
        id: "about_modal2",
        title1: "建築歷史",
        title2: "—ARCHITECTURAL HISTORY—",
        img: "./images/about2.png",
        img2: "./images/about2-1.png",
        text: [
            "集順廟原創建於1838年整座建築以木構造為主，寺廟原建築以木頭構造為主，十分古色古香，但在歲月洗禮下，集順廟歷經多次修建，後於 1989 年改建為現今的兩層樓鋼筋混凝建築，改建後的廟貌華麗卻失去古意。",
            "石碇位於新北市山區，因地理環境及交通因素限制，工商業並不發達，清康熙年多以農業為主。由於開墾過程艱辛，相傳，保儀尊王可以保祐開墾山坡地順利平安因此一樓供奉保儀尊王。",
            "日治時期日本人以及台灣礦業鉅子合資在石碇設立「台北炭礦株式會社」，石碇居民原有的農耕生活型態開始了重大的改變，信仰也隨即改變。石碇成為北部煤礦產區，而呂洞賓則是被煤礦業者視為保護的神祇並在二樓明德宮供奉孚佑帝君（呂洞賓）。"
        ]
    },
    {
        id: "about_modal3",
        title1: "供奉神祇",
        title2: "—FAITH AND WORSHIP—",
        img: "./images/about3.png",
        img2: "./images/about3-1.png",
        text: [
            "一樓集順廟主祀雙忠(保儀尊王及保儀大夫) ，保儀尊王、保儀大夫二人為唐朝安史之亂時的張巡、許遠。唐朝安祿山造反時，許遠和張巡起兵討伐。一年，賊兵用十三萬大軍把尹子奇押在睢陽，張巡和許遠仍堅守孤城，但最後仍因饑餓而為國犧牲，於是大家便為這兩位忠臣建廟。後民間尊張巡為「保儀尊王」，許遠為「保儀大夫」。",
            "集順廟的保儀尊王在唐末黃巢之亂時保護了高、張、林三姓，後來他們來台開墾時仍信奉此神，因此神威顯赫聲名遠播。",
            "一樓主神龕前神桌供奉觀音佛祖、中壇元帥、司命灶君、福德正神，龍邊神龕奉祀關聖帝君，虎邊神龕奉祀天上聖母，兩側還有祀千里眼將軍及順風耳將軍。",
            "二樓明德宮主祀孚佑帝君(呂洞賓) 即八仙裡的呂洞賓，又稱「純陽祖師」、「呂仙公」、「呂祖」等，亦簡稱仙公。屬於五文昌之一，是醫藥、製墨等行業的守護神，也常被煤礦業者視為保祐他們的神祇。",
            "二樓主神龕前神桌供奉太上感應篇神位，龍邊神龕奉祀王靈天君，虎邊神龕奉祀張大帝。",
        ]
    }
]
const information_data = [
    {
        title: "購",
        class: "order-1",
        text: "選購一個平安符，依照平安符對應香爐標示顏色參拜(右圖)",
    },
    {
        title: "香",
        class: "order-2",
        text: "點香，每樓各五炷",
    },
    {
        title: "拜",
        class: "order-3",
        text: "依照香爐順序上香",
    },
    {
        title: "繞",
        class: "order-5",
        text: "最後以「∞」符號將平安符遶香爐三次",
    },
]

const question_data = [
    {
        ques: "請問集順廟是否提供「點光明燈」的服務？",
        ans: "有福祿壽平安燈龍，請洽廟公或來電報名(02-26633398)<br>\
            1.將於農曆新年期間開放有福祿壽平安燈龍活動<br>\
            2.	有全家平安符燈籠(每盞1200元)以及個人平安燈籠(每盞600元)兩種形式。<br>\
            3.	平安燈龍將全年掛置於廟堂大廳正前方，保有點燈著全家及個人元辰光彩，財運亨通，事業發達，學業進步，姻緣美滿，身體健康，諸事圓滿大吉祥。<br>\
            4.	目前並沒有開放線上點燈的服務。",
        keyword: ["光明燈", "平安燈籠"]
    },
    {
        ques: "請問集順廟是否提供「安太歲」的服務?",
        ans: "本廟有提供安太歲的服務，請犯太歲的本人到現場向主神參拜，可以跟點光明燈一同。",
        keyword: ["安太歲"]
    },

    {
        ques: "請問集順廟是否提供「收驚」的服務?",
        ans: "本廟目前沒有提供此服務",
        keyword: ["收驚"]
    },

    {
        ques: "想參加集順廟的誦經班該如何報名呢?",
        ans: "請洽廟公或來電報名(02 - 26633398)",
        keyword: ["誦經班"]
    },
    {
        ques: "每年農曆二月及十月的遶境活動一般民眾是否能參加?如何報名呢？",
        ans: "一般民眾可一同參予、請洽廟公報名 (02 - 26633398)",
        keyword: ["繞境", "遶境"]
    },
    {
        ques: "請問集順廟是否有「媽祖遶境」的活動?",
        ans: "每五年將有一次迎媽祖遶境活動、天上聖母會進駐在石碇集順廟、到時歡迎四方信徒前來參拜！",
        keyword: ["媽祖遶境", "媽祖"]
    },
    {
        ques: "我要如何祈求平安符?",
        ans: "可先在線上選擇最適合自己的平安符，並到石碇集順廟現場購買。",
        keyword: ["平安符"]
    }
]
const aboutsd_data = {
    calma: {
        title: "淡定鱷介紹",
        class: "ins-1",
        text: "淡碇鱷的由來：<br><br>\
        淡碇鱷是以石碇鱷魚島爲發想所創造出來的石碇吉祥物,以「淡蘭古道」與「石碇」命名,另一層含義則為「淡定」,期望每個到訪石碇的旅人都能融入這片自然,進而「從容淡定」。",
    },
    sdos: {
        title: "石碇老街介紹",
        class: "ins-2",
        text: "石碇老街是石碇地區最早發展的區域，以石砌橋墩所搭成的萬壽橋劃分成東西兩街，西街發展較早，早期以製造及買賣大菁、茶葉為主，房屋以當地石頭為主要建材所建築石頭屋\
        ；東街傳說則是乞丐的聚集住所，素有乞丐寮之稱。目前東街的人口比例漸比西街多，並逐漸取代往日的西街，成為石碇區較繁榮的地方。",
    },
    feature: {
        title: "石碇老街介紹"
    }
}
const feature_data = [
    {
        num: "1",
        title: "不見天街",
        text: "石碇老街以萬壽橋劃分成東西兩街，其中的石碇東街是目前全台灣少數僅存的不見天街，也是遊客至石碇遊玩的必訪之處。此處因地理環境條件限制，\
        發展出建於河床上的吊腳樓及不見天街等特殊景觀，過去不見天街街道兩旁是當地住家的廚房及客廳，上方二樓是居家空間，街道上方被建築物覆蓋不見天日，\
        形成了遮風避雨的空間，也成了買賣茶葉的地方，現在的不見天街兩旁則是一間一間的商店，販賣茶葉與在地特產，還有一些餐飲店，也是目前石碇最為熱鬧繁榮的地方啦。",
    },
    {
        num: "2",
        title: "吊腳樓",
        text: "石碇東街除了是特別的不見天街之外，還有著特殊的吊腳樓建築，此處的房子沿溪而建，靠溪側的建築物使用柱子支撐起來，讓房屋懸空於河床上方，形\
        成了獨特的吊腳樓建築景觀，吊腳樓從日據時代保留至今，當時是居民為了解決腹地狹小所發展出來的變通之道，數十年過去，這些吊腳樓依然屹立不搖，也形成\
        了石碇特殊的風景，來到石碇東街，不妨駐足欣賞欣賞。",
    },
    {
        num: "3",
        title: "百年石頭屋",
        text: "位於石碇東街的百年石頭屋建於民國前6年，是一棟有著上百年歷史的古老石頭厝，房子只砌了三面牆，後方的牆壁及階梯則是利用原本的山壁鑿石而成，\
        此處原為林恆春中藥舖，現在開放免費參觀，在大廳裏頭還擺放著中藥櫃、石臼、手秤等舊時的器物，從石階往上爬，還可通往一處後花園，石頭桌椅爬滿了青苔，\
        洋溢一股遺世獨立的美感。",
    }
]
